import { Building2, FileText, HomeIcon, Scale, Briefcase, HelpCircle } from 'lucide-react'
import { images } from './images'

export const services = [
  {
    icon: FileText,
    title: 'التوثيق والعقود',
    description: 'إعداد وتوثيق عقود البيع والإيجار.',
    content: 'نقدم خدمات شاملة لإعداد وتوثيق جميع أنواع العقود العقارية، بما في ذلك عقود البيع والإيجار. نضمن أن تكون جميع الوثائق قانونية ودقيقة، مما يوفر الحماية لجميع الأطراف المعنية.',
    imageUrl: '/images/services/imgd.jpg'
  },
  {
    icon: Building2,
    title: 'الوساطة العقارية',
    description: 'خدمات وساطة احترافية لبيع وشراء العقارات.',
    content: 'نقدم خدمات وساطة عقارية احترافية تساعد في تسهيل عمليات البيع والشراء. نعمل على ربط البائعين والمشترين، ونقدم المشورة حول أسعار السوق، ونساعد في التفاوض للحصول على أفضل الصفقات.',
    imageUrl: '/images/services/imgb.jpg'
  },
  {
    icon: Scale,
    title: 'التقييم العقاري',
    description: 'تقييم دقيق للعقارات بناءً على معايير السوق.',
    content: 'نوفر خدمات تقييم عقاري دقيقة ومحايدة. نستخدم أحدث الأساليب والبيانات السوقية لتقديم تقييمات موثوقة للعقارات السكنية والتجارية، مما يساعد العملاء على اتخاذ قرارات مستنيرة.',
    imageUrl: '/images/services/imgc.jpg'
  },
  {
    icon: HomeIcon,
    title: 'إدارة الأملاك',
    description: 'خدمات شاملة لإدارة العقارات.',
    content: 'نقدم خدمات إدارة أملاك شاملة تغطي جميع جوانب إدارة العقارات. نتولى مسؤولية تحصيل الإيجارات، وإدارة الصيانة، والتعامل مع المستأجرين، مما يضمن تشغيل عقاراتك بسلاسة وكفاءة.',
    imageUrl: '/images/services/imgp.jpg'
  },
  {
    icon: Briefcase,
    title: 'الخدمات العامة',
    description: 'تسهيل جميع الإجراءات العقارية.',
    content: 'نقدم مجموعة واسعة من الخدمات العامة المتعلقة بالعقارات، بما في ذلك المساعدة في الإجراءات القانونية، وتسجيل العقارات، والحصول على التراخيص اللازمة. نهدف إلى تبسيط العمليات العقارية لعملائنا.',
    imageUrl: '/images/services/imgm.jpg'
  },
  {
    icon: HelpCircle,
    title: 'الاستشارات العقارية',
    description: 'نصائح واستراتيجيات لتحقيق أفضل عائد استثماري.',
    content: 'نقدم استشارات عقارية متخصصة لمساعدة العملاء على اتخاذ قرارات استثمارية ذكية. نوفر تحليلات السوق، ونقدم المشورة حول استراتيجيات الاستثمار، ونساعد في تطوير خطط لتحسين العائد على الاستثمار العقاري.',
    imageUrl: '/images/services/imgp.jpg'
  },
]

